/*这是实验一的测试用例，
//大家把测试界面截图放到实验报告测试文件中*/
@xy      //测试非法字符
#include     //测试非法字符
abc45  _ab    //测试正常标识符
8_it5          //测试异常标识符
12             //测试正常十进制整数
12a            //测试异常十进制整数
1.2             //测试正常浮点数
15.           //测试异常浮点数
 .765       //测试异常浮点数
1.2.3         //测试异常浮点数
1.2e2+3    //测试正常浮点数
05.234e    //测试异常浮点数
0.12-e4    //测试异常浮点数
0x34          //测试正常16进制数
0x3g          //测试异常16进制数
00x45       //测试异常16进制数
0712         //测试正常8进制数
0912         //测试异常8进制数
0020        //测试异常8进制数
01110       //测试二进制数，选做
0211        //测试二进制数，选做
+     ++     +=     >==3  //测试双运算符
char a='x';   //测试异常字符常量
b = 'b;         //测试异常字符常量
string d="12;     //测试异常字符串常量
c = "acc";    //测试正常字符串常量
1122
   

